ka2_2024/src/InformationRegisters/СвязиПоказателейБюджетов/СвязиПоказателейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиПоказателейБюджетов</name>
  <resources>
    <name>Расход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйПоказательБюджетов</name>
    <type>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/СвязиПоказателейБюджетов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекстТранслируется", НСтр("ru = 'транслируется'"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекстПрочие", НСтр("ru = 'Прочие'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Приход", НСтр("ru = 'Приход'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Расход", НСтр("ru = 'Расход'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Список.УсловноеОформление.Элементы.Очистить();
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика1");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика2");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика3");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика4");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика5");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика2");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика3");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика4");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика5");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика3");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика4");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика5");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 2;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика4");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика5");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 3;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика5");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 4;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Аналитика6");;
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоИспользуемыхАналитик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 5;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	
КонецПроцедуры

#КонецОбласти
